rails_app/app/controllers/boards_controller.rb

SELECT "boards".* FROM "boards" WHERE ("boards"."id" IN (SELECT "boards"."id" FROM "boards" WHERE "boards"."owner_id" = 1) OR "boards"."id" IN (SELECT "boards"."id" FROM "boards" INNER JOIN "board_members" ON "boards"."id" = "board_members"."board_id" WHERE "board_members"."user_id" = 1)) ORDER BY "boards"."updated_at" DESC
---
  def index
    @boards = current_user.all_boards.includes(:owner, :members).order(updated_at: :desc)
    @boards_by_level = @boards.group_by(&:level)