rails_app/app/controllers/board_members_controller.rb

  def index
    @members = @board.board_members.includes(:user)
    @available_users = User.where.not(id: [@board.owner_id] + @board.members.pluck(:id))
---
SELECT "board_members".* FROM "board_members" WHERE "board_members"."board_id" = 2
SELECT "users"."id" FROM "users" INNER JOIN "board_members" ON "users"."id" = "board_members"."user_id" WHERE "board_members"."board_id" = 2

  def set_board
    @board = Board.find(params[:board_id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = 2 LIMIT 1