rails_app/app/controllers/cards_controller.rb

  def move
    new_column = @board.columns.find(params[:column_id])
---
SELECT "columns".* FROM "columns" WHERE "columns"."id" = 1 LIMIT 1

  def set_board
    @board = Board.find(params[:board_id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = 1 LIMIT 1

  def set_card
    @card = @board.cards.find(params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."board_id" = 1 AND "cards"."id" = 2 LIMIT 1