rails_app/app/views/cards/show.html.erb

SELECT "columns".* FROM "columns" WHERE "columns"."id" = 1 LIMIT 1
---
      <%= render partial: 'shared/priority_badge', locals: { priority: @card.priority } %>
      <span class="text-sm text-gray-500">in <%= @card.column.name %></span>