app/tasks/concerns/finds_card.rb

SELECT "cards".* FROM "cards" WHERE "cards"."id" = 9 LIMIT 1
---
  def find_card
    card = Card.find_by(id: task.card_id)