rails_app/app/views/board_members/index.html.erb

SELECT "board_members".* FROM "board_members" WHERE "board_members"."board_id" = 2
---
              <%= form_with model: [@board, member], class: "flex items-center gap-2" do |f| %>
                <%= f.select :role, BoardMember::ROLES.map { |r| [r.titleize, r] }, {}, class: "rounded-md border-gray-300 text-sm focus:border-blue-500 focus:ring-blue-500", onchange: "this.form.requestSubmit()" %>