rails_app/app/views/boards/index.html.erb

                  <div class="mt-4 flex items-center gap-2 text-xs text-gray-500">
                    <span><%= board.cards.count %> cards</span>
---
SELECT COUNT(*) FROM "cards" WHERE "cards"."board_id" = 1