app/views/boards/_column.html.erb

      <span class="inline-flex items-center rounded-full bg-gray-200 px-2 py-0.5 text-xs font-medium text-gray-700">
        <%= column.cards.count %>
---
SELECT COUNT(*) FROM "cards" WHERE "cards"."column_id" = 4