rails_app/app/models/board.rb

  def create_default_columns
    columns.create!([
      { name: 'To Do', position: 0 },
      { name: 'In Progress', position: 1 },
      { name: 'Done', position: 2 }
    ])
---
INSERT INTO "columns" ("board_id", "name", "position", "created_at", "updated_at") VALUES (1, 'To Do', 0, '2026-01-18 00:18:59.627629', '2026-01-18 00:18:59.627629') RETURNING "id"