rails_app/app/models/card.rb

UPDATE "cards" SET "column_id" = 2, "updated_at" = '2026-01-18 00:59:12.540367' WHERE "cards"."id" = 2
---
  def move_to(new_column, new_position)
    transaction do
      old_column = column
      old_position = position

      if new_column == old_column
        # Moving within same column
        if new_position > old_position
          old_column.cards.where('position > ? AND position <= ?', old_position, new_position)
                    .update_all('position = position - 1')