app/controllers/application_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."id" = 2 LIMIT 1
---
  def require_board_access!
    @board = Board.find(params[:board_id] || params[:id])