app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email])

    if user
      session[:user_id] = user.id
      user.update(last_signed_in_at: Time.current)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'demo@example.com' LIMIT 1
UPDATE "users" SET "last_signed_in_at" = '2026-01-18 00:27:45.539253', "updated_at" = '2026-01-18 00:27:45.540155' WHERE "users"."id" = 1