rails_app/app/tasks/type_inference_task.rb

UPDATE "cards" SET "updated_at" = '2026-01-18 15:54:26.664326', "card_type" = 'bug', "type_inference_confidence" = 'high', "type_inferred_at" = '2026-01-18 15:54:26.664149' WHERE "cards"."id" = 10
---
    def perform_work
      card = task.card

      # Get inference result from either KeywordMatch or LlmInfer
      keyword_result = task.result_for(KeywordMatch)
      llm_result = task.result_for(LlmInfer)

      # Use whichever found a type
      inference = if keyword_result&.dig(:type).present?
        keyword_result
      else
        llm_result
      end

      card.update!(
        card_type: inference[:type],
        type_inference_confidence: inference[:confidence].to_s,
        type_inferred_at: Time.current
      )